Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: ངོས་གཉིས་པར་རྒྱ་མཚོ་ཆེན་པོའི་རིའི་རྒྱལ་པོ་རི་རབ་ཆེན་པོ་ཆོ་ག་དེ་ལྟ་བུས་ཡུངས་ཀར་གྱི་འབྲས་བུ་ཙམ་དུ་བྱས་པ་ལས་སླར་ཡང་རིའི་རྒྱལ་པོ་རི་རབ་དུ་གནས་པར་བྱེད་པར་ནུས་ཀྱི་ཆོ་ག་ཞིབ་མོའི་རྒྱལ་པོ་གང་ཡིན་པ་འདི་འདྲི་བཞིན་པའི་བསོད་ནམས་ཀྱི་ཕུང་པོའི་དགེ་བའི་རྩ་བ་ནི་མི་ནུས་ཏེ།
en: It would be possible for a powerful man to cast mustard seeds from the top of Mount Sumeru, the king of mountains, and build a second Mount Sumeru, the great king of mountains, on the other side of the great ocean. It would not be possible, however, to fathom the amount of merit and the roots of virtue acquired by someone who proficiently writes this sovereign ritual down.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་སྤྱན་དང་། དེའི་གསུང་གི་ཚད་གཟུང་བར་མི་ནུས་སོ།
en: Not even all the tathāgatas, endowed with the eye and speech of a buddha, would be able to grasp it.

source: །དེ་བཞིན་དུ་ཡོན་ཏན་དང་། ཕན་ཡོན་རྒྱ་ཆེ་ཞིང་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཆེན་པོ་ཡོངས་སུ་འཛིན་ཏེ། དགེ་བའི་རྩ་བ་ཆེན་པོ་བསྐྱེད་པར་བྱིན་གྱིས་བརླབས་པར་འགྱུར་རོ་ཞེས་སོ།
en: This dhāraṇī is thus blessed and empowered to produce vast qualities and benefits, to accumulate a great amount of merit, and to plant roots of great virtue.”

source: །རྡོ་རྗེ་འཛིན་པས་གསོལ་པ། བཅོམ་ལྡན་འདས་རིག་པའི་རྒྱལ་པོའི་ཆོ་ག་ཞིབ་མོ་དང་། ཕྱག་རྒྱ་འདི་ཅི་ལྟར་བྲི་བར་བགྱི།
en: Vajradhara asked, “How, Lord, should one write down this rite of the king of vidyās and its mudrās?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ལག་ན་རྡོ་རྗེ་ཉོན་ཅིག །རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོའམ། དགེ་སློང་ངམ། དགེ་སློང་མའམ། དགེ་བསྙེན་ནམ། དགེ་བསྙེན་མའམ། དགེ་སྦྱོང་ངམ། བྲམ་ཟེའམ། རྒྱལ་རིགས་སམ། རྗེའུ་རིགས་སམ། དམངས་རིགས་སམ། བུད་མེད་དམ། སྐྱེས་པའམ། ཁྱེའུའམ།
en: The Blessed One replied, “Listen, Vajrapāṇi!

source: བུ་མོ་གང་ལ་ལ་ཆོ་ག་ཞིབ་མོའི་རྒྱལ་པོ་འདི་འདྲི་བར་བྱེད་པ་དེ། ཕྱག་རྒྱ་དང་། གསང་སྔགས་རིམ་པར་ཕྱེ་བ་དང་། དཀྱིལ་འཁོར་གྱི་ལས་དང་། ཡོ་བྱད་དང་བཅས་པའི་ཆོ་གས་དོན་ཡོད་པའི་ནོར་བུའི་པདྨ་ཞགས་པའི་སྙིང་པོའི་གཟུངས། དོན་ཡོད་ཞགས་པའི་སྙིང་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་རྣམ་པར་འཕྲུལ་པའི་འཁོར་ལོ་དཀྱིལ་འཁོར་ཆེན་པོ་དང་། ཕྱག་རྒྱ་དང་། དཀྱིལ་འཁོར་ཆེན་པོའི་ཀླུའི་ཞགས་པའི་རྣམ་པར་འཕྲུལ་པ་འདི་འདྲི་བར་བྱེད་དོ། །དེས་ཡོངས་སུ་དག་པའི་ངག་དང་ཡིད་ཀྱིས་དང་།
en: The vidyā holder—whether a son or daughter of good family, a monk or nun, a male or female lay practitioner, an ascetic, brahmin, kṣatriya, vaiśya, or śūdra, a woman, man, boy, or girl—who writes down this sovereign ritual with its sets of mudrās and mantras, its maṇḍalas and ritual performances that include this heart dhāraṇī of Amogha­maṇi­padma­pāśa that is the heart essence of Amoghapāśa; who writes down this maṇḍala-seal, a magically created circle of Noble Avalokiteśvara, the magical noose of the nāga Mahāmaṇḍalin, should do so with complete purity in their speech, mind, and heart.

source: ལྷག་པའི་བསམ་པ་དང་། གུས་པ་དང་བཅས་པ་དང་། ཡིད་དེར་གྱུར་པ་དང་། མཆོད་པའི་མཆོག་དང་། གུས་པ་ལ་སོགས་པའི་འདྲི་མཁན་གྱིས་བྲི་བར་བྱའོ།
en: As a scribe, they must have a respectful attitude and great devotion, and their writing should be an ultimate act of worship. “

source: །མཆོག་ཏུ་གུས་པ་དང་། ཞེ་ས་དང་བཅས་པས་ཁ་ཟས་མི་མཐུན་པ་སྤངས་ཏེ། ལེགས་པར་ཡོངས་སུ་རྫོགས་པའི་ཁ་ཟས་རོ་བྲོ་བའི་མཆོག་དང་།
en: The vidyā holder should adopt supreme respect and devotion, abstain from food that is not appropriate, and subsist instead on any suitable natural foods that are of the best flavors.

source: ལེགས་པར་འདུས་བྱས་ཤིང་ཡིད་དགའ་བའི་མེ་ཏོག་དང་འབྲས་བུའི་བཏུང་བ་གུས་པ་དང་བཅས་པས།
en: He should use flowers, fruits, and beverages that are natural and gratifying.

source: གནས་སུ་གི་ཝང་གི་དཀྱིལ་འཁོར་དང་། མེ་ཏོག་གཅལ་དུ་བཀྲམ་ནས་དྲི་ཡིས་བདུགས་ཏེ།
en: He should use bovine bezoar to respectfully demarcate the maṇḍala area and then strew it with flowers, perfume it with fragrances, cense it with incense, and adorn it with streamers.

source: དར་གྱིས་སྤྲས་པའི་ཆོས་ཀྱི་སྟན་ལ་འདུག་པས་བྲི་བར་བྱའོ།
en: He should draw it while sitting on a Dharma seat.

source: །ལེགས་པར་ཁྲུས་བྱས་ཤིང་མགོ་ལ་དྲིས་བྱུག །ལུས་ལ་གོས་བགོས་ལ་མཆོད་པ་བྱའོ།
en: He should then purify himself by bathing, anoint his head with fragrances, cover his body in clean garments, and make offerings. “

source: །ཚེས་བརྒྱད་དམ་བཅོ་ལྔ་ལ་སོ་སོའི་ཆ་ཤས་དང་བཅས་པའི་དཀྱིལ་འཁོར་རྣམ་པར་ཕྱེ་ནས་གཏོར་མ་དང་།
en: On the eighth or the fifteenth lunar day, the vidyā holder should carefully delimit the sections of the maṇḍala and offer a bali of foodstuffs.

source: ཉེ་བར་སྤྱོད་པ་དབུལ་བར་བྱའོ། །མཆོག་ཏུ་དགའ་བའི་ཡིད་ཀྱིས་བྱ་སྟེ། ཡོན་དང་བཅས་པས་གསེར་གྱི་རྣ་རྒྱན་སྦྱིན་པར་བྱའོ། །བྲི་བར་བྱ་བ་ཡོངས་སུ་མ་སྤངས་པར་དོན་ཡོད་པར་བྱའོ། །ལག་པ་བརྐྱང་བས་བྱའོ།
en: Cultivating deep affection, he should offer a golden flower bud, along with other presents, and complete the act of writing as an act of devotion without giving up.

source: །ལེགས་པར་སྦྱང་བ་བྱས་པས་བྱའོ། །འདི་ཡི་ཆོ་གས་འདྲི་བར་བྱེད་པ་གང་ཡིན་པ་དེས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་རིགས་ཀྱི་གསང་བའི་དམ་ཚིག་དང་། དཀྱིལ་འཁོར་དང་ཕྱག་རྒྱ་རིམ་པར་ཕྱེ་བ་དང་། གསང་བ་བྲིས་པར་འགྱུར་རོ། །འདི་ལྟ་སྟེ། དེ་བཞིན་གཤེགས་པའི་རིགས་དང་། ནོར་བུའི་རིགས་དང་། པདྨའི་རིགས་དང་། རྡོ་རྗེའི་རིགས་གང་ཅི་ཡིན་པ་དང་།
en: The vidyā holder should extend his hand and carry out the task with all due care, and in so doing he will transmit the sets of secret maṇḍalas and mudrās and the secret samayas of all tathāgata families, namely the tathāgata, jewel, lotus, and vajra families.

source: དེ་བཞིན་གཤེགས་པ་རྣམ་པར་སྣང་མཛད་ཀྱི་སྙིང་པོའི་དཀྱིལ་འཁོར་ཆེན་པོ་དེ་ཐམས་ཅད་འདྲི་བར་འགྱུར་རོ། །འདི་ལྟ་སྟེ།
en: He should write down everything that pertains to the great maṇḍala that houses the Tathāgata Vairocana.

source: ཆུ་གང་ཡིན་པ་ཐམས་ཅད་ཆུ་གང་ཆེན་པོ་དང་། རྒྱ་མཚོ་ཆེན་པོའི་རྗེས་སུ་ཞུགས་ནས་རོ་གཅིག་ཏུ་འགྱུར་རོ། །འདི་ལྟ་སྟེ་ཉི་མ་ཤར་བ་ན་མུན་པས་ལྡོངས་པ་ཐམས་ཅད་ཀུན་ཏུ་སྣང་བར་བྱེད་དོ། །དེ་ཁོ་ན་བཞིན་དུ་དོན་ཡོད་པའི་ལྕགས་ཀྱུའི་རིག་པའི་རྒྱལ་པོའི་སྙིང་པོ་འདི་དང་། དོན་ཡོད་པའི་ནོར་བུའི་མཆོད་པའི་སྙིང་པོ་འདི་དང་།
en: Just as all the water of a great river merges inseparably with the great ocean, or just as darkness turns to light when the sun rises, in the same way this heart dhāraṇī of Amoghāṅkuśa, of precious amogha offerings, and of Amogha­maṇi­padma­pāśa is the heart essence of Noble Avalokiteśvara.

source: དོན་ཡོད་པའི་ཞགས་པའི་ནོར་བུ་པདྨའི་སྙིང་པོའི་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་སྙིང་པོ་དང་། རྣམ་པར་འཕྲུལ་པ་དང་། དཀྱིལ་འཁོར་དང་། དཀྱིལ་འཁོར་ཆེན་པོ་དང་། ཕྱག་རྒྱ་དང་།
en: It is the great maṇḍala-seal, a magically created circle, and the magical noose of the nāga Maṇḍalin.

source: དཀྱིལ་འཁོར་པའི་ཀླུའི་ཞགས་པའི་རྣམ་པར་འཕྲུལ་པ་འདི་ཐམས་ཅད་དུ་མཚུངས་པར་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་གསང་བའི་རྗེས་སུ་འཇུག་གོ།
en: It secretly merges with all tathāgatas equally.

source: །དམ་ཚིག་དང་། ཕྱག་རྒྱ་དང་། སྙིང་པོ་རྣམས་མཚུངས་པར་དུས་གསུམ་པའི་དེ་བཞིན་གཤེགས་པའི་རིགས་སུ་རབ་ཏུ་སྐྱེས་པའོ།
en: It truly is the essence of the samaya seal that originates equally from the tathāgata families of the three times.

source: །ཐམས་ཅད་དུ་མཚུངས་པར་མཆོད་པའི་སྤྲིན་གྱི་རྣམ་པར་འཕྲུལ་པའོ།
en: It produces a magical cloud of offerings shared equally among them. “

source: །གང་ཡང་དུས་གསུམ་པའི་དེ་བཞིན་གཤེགས་པའི་རྡུལ་ཕྲ་རབ་དང་ལྷན་ཅིག་པའི་དེ་བཞིན་གཤེགས་པའི་གསུང་གི་ཐ་སྙད་ཀྱི་དེ་ཁོ་ན་ཉིད་ཡང་དག་པའི་སྙིང་པོའོ།
en: This dhāraṇī is the true essence of the speech of the tathāgatas who are established throughout the three times and as numerous as the atoms in the universe.

source: །དོན་ཡོད་པ་ནོར་བུ་མཆོད་པའི་སྙིང་པོའི་གཟུངས་དང་། དོན་ཡོད་པ་ནོར་བུ་པདྨའི་ཞགས་པའི་སྙིང་པོ་དང་། འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་སྙིང་པོ་དང་།
en: This heart dhāraṇī of precious amogha offerings, of Amogha­maṇi­padma­pāśa, is the heart dhāraṇī of Noble Avalokiteśvara.

source: གཟུངས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་དང་། འཁོར་ལོ་དང་། དཀྱིལ་འཁོར་ཆེན་པོ་དང་། ཕྱག་རྒྱའི་དཀྱིལ་འཁོར་པ་དང་། ཀླུའི་ཞགས་པའི་རྣམ་པར་འཕྲུལ་བ་དང་།
en: It is the great maṇḍala-seal, a magically created circle, the magical noose of the nāga Maṇḍalin that has been taught in full by the Tathāgata Vairocana.

source: དེ་བཞིན་གཤེགས་པ་རྣམ་པར་སྣང་མཛད་ཀྱིས་གསུངས་པ་དེ་ཐམས་ཅད་གསང་བའི་དམ་ཚིག་གཅིག་ཏུ་བྱིན་གྱིས་བརླབས་སོ།
en: It is blessed with a unique secret samaya.

source: །རྒྱུ་དེའི་ཕྱིར་འདི་ནི་དོན་ཡོད་ཞགས་པའི་དོན་ཡོད་པའི་ལས་སྒྲུབ་པར་བྱེད་པའི་མཐུ་སྟོབས་ཀྱི་དངོས་གྲུབ་སྟེ།
en: For this reason, performing the amogha ritual practice of Amoghapāśa brings power and accomplishment.

source: དོན་ཡོད་ཞགས་པའི་སྙིང་པོ་དང་། །དོན་ཡོད་ཞགས་པའི་རྣམ་པར་འཕྲུལ་པའོ། །ཞེས་བརྗོད་པར་བྱའོ།
en: This dhāraṇī is said to be the heart essence of Amoghapāśa and his miraculous transformation. “

source: །དེ་བཞིན་དུ་འདྲི་བཞིན་པའི་དགེ་བའི་རྩ་བ་དང་། བསོད་ནམས་ཀྱི་ཕུང་པོ་ཆེན་པོ་ཡོངས་སུ་འཛིན་པར་འགྱུར་རོ།
en: Thus, the vidyā holder who writes down this sovereign ritual plants roots of great virtue and accumulates a great amount of merit.

source: །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་གསང་བ་དང་། མཚུངས་པ་གཅིག་གིས་མཚུངས་པའོ། །དོན་ཡོད་པའི་ཞགས་པའི་ལྕགས་ཀྱུའི་སྙིང་པོའི་ཆོ་ག་ཞིབ་མོར་བྱིན་གྱིས་བརླབས་སོ།
en: This essential secret ritual of Amogha­pāśāṅkuśa is equal to the secret rites of all tathāgatas.

source: །འདྲི་བར་བྱེད་པ་དང་། འདོན་པར་བྱེད་པ་དང་། ཀློག་པར་བྱེད་པ་དང་། བཟླས་པ་ནི་མཆོད་པའི་སྤྲིན་དུ་བྱིན་གྱིས་བརླབས་སོ།
en: Writing, reading aloud, studying, or reciting its dhāraṇī conjures cloud-like masses of offerings and conveys blessings.

source: །དེའི་ཕྱིར་འདི་ནི་རིག་སྔགས་འཆང་གིས་ལེགས་པར་རབ་ཏུ་དང་བ་དང་ལས་ལ་སྤྲོ་ཞིང་བརྩོན་པས་བྱའོ། །ཤིན་ཏུ་གསལ་བ་དང་།
en: The vidyā holder should therefore apply himself to these pure activities with resolve.

source: སྤྲོ་བ་དང་། མཆོག་ཏུ་དགའ་བ་དང་། དད་པས་བྲི་བར་བྱའོ།
en: With his aim clearly defined, he should undertake the task of writing with supreme joy and peaceful composure.

source: །ཤིན་ཏུ་འབད་པས་ཕྱག་རྒྱ་དང་གསང་སྔགས་ཀྱི་སྙིང་པོ་དང་། གསུང་དང་། ཕྱག་རྒྱའི་དཀྱིལ་འཁོར་དང་། ཀླུའི་ཞགས་པའི་རྣམ་པར་འཕྲུལ་པ་བྲི་བར་བྱ། བཀླག་པར་བྱ།
en: Employing the mudrā and the mantra with due care, he should write down the heart dhāraṇī and the mudrā and maṇḍala instructions, which are the magical creation of the nāga noose. “

source: མཉན་པར་བྱའོ། །མཐུ་སྟོབས་ཀྱིས་མཉན་པར་བྱའོ།
en: In weakness and in strength, the vidyā holder should read this maṇḍala of liberation, listen to it, and read it aloud to others.

source: །མཐུ་སྟོབས་ཀྱིས་བྲི་བར་བྱ།
en: In weakness and in strength, he should write it down.

source: །མཐུ་སྟོབས་ཀྱིས་མཆོད་པ་དང་བསྙེན་བཀུར་བྱའོ།
en: In weakness and in strength, he should worship and honor it.

source: །མཐུ་སྟོབས་ཀྱིས་དམ་པའི་ཆོས་མཆོད་པ་དང་། གུས་པས་འདྲི་བར་བྱེད་པ་པོ་དང་།
en: In weakness and in strength, he should treat it with respect that is due to the true Dharma.

source: འདྲི་བཞིན་པ་ལ་བསྙེན་བཀུར་དང་། བླ་མ་ལ་སྲི་ཞུ་བྱེད་པར་བྱའོ།
en: When writing it, he should keenly and respectfully obey his teacher.

source: །འདི་ནི་མཆོག་ཏུ་གསང་བའོ། །དོན་ཡོད་ཞགས་པའི་རྣམ་པར་ཐར་པའི་དཀྱིལ་འཁོར་གྱི་གསང་བའོ།
en: This maṇḍala of liberation of Amoghapāśa is supremely secret. “

source: །ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་གསང་བ་དང་། དཀྱིལ་འཁོར་དང་། ཕྱག་རྒྱ་དང་། གཟུངས་ཀྱི་གསང་བ་བྱིན་གྱིས་བརླབས་པ་ནི་གཉིས་ཏེ། གཅིག་ནི་དོན་ཡོད་པའི་མཆོད་པའི་སྙིང་པོའི་གཟུངས་སོ།
en: There are two secret great dhāraṇīs, precious as gems, that are each a secret maṇḍala-seal of all the tathāgatas and a vessel of their blessing.

source: །གཉིས་པ་ནི་དོན་ཡོད་པའི་ནོར་བུའི་པདྨ་ཞགས་པའི་སྙིང་པོའོ།
en: One of them is the heart dhāraṇī of precious amogha offerings, and the other is the heart dhāraṇī of Amogha­maṇi­padma­pāśa.

source: །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་སྙིང་པོ་རྣམ་པར་འཕྲུལ་པ་དང་། འཁོར་ལོ་དང་། དཀྱིལ་འཁོར་ཆེན་པོའི་སྙིང་པོ་དང་། ཕྱག་རྒྱ་དང་།
en: Both dhāraṇīs constitute a great maṇḍala-seal circle that has been magically transformed from the heart essence of Noble Avalokiteśvara.

source: དཀྱིལ་འཁོར་ཆེན་པོའི་ཀླུའི་ཞགས་པས་རྣམ་པར་འཕྲུལ་པས་སྤྲུལ་པའོ།
en: Both possess the miraculous properties of the magical noose of the nāga Mahāmaṇḍalin.

source: །འདི་ནི་ཡིད་བཞིན་གྱི་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོར་འགྱུར་བ་སྟེ། དོན་ཡོད་པའི་དཔག་བསམ་གྱི་ཤིང་གི་མཆོད་པ་ཆེན་པོ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྙིང་པོ་དོན་ཡོད་པའི་ཞགས་པའི་གསང་བ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་བྱིན་གྱིས་བརླབས་པའོ།
en: Both are a precious wish-fulfilling jewel, and they are an unfailing wish-fulfilling tree that produces great offerings. Both are the heart essence of all tathāgatas and a secret unfailing noose blessed by all the tathāgatas.

source: །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དམ་པར་གྱུར་པའི་སྙིང་པོ་དོན་ཡོད་པའི་ཡིད་བཞིན་གྱི་ནོར་བུ་སྟེ། འདི་ནི་གཉིས་པར་རིག་སྔགས་འཆང་རྣམས་ཀྱི་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་སྟེ། དོན་ཡོད་པའི་རྣམ་པར་འཕྲུལ་པ་སྒྱུ་མ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་གྱི་རྣམ་པར་འཕྲུལ་པ་ཡིན་ནོ། །དེ་ནས་ཕྱག་ན་རྡོ་རྗེ་ལ་སོགས་པ་རིག་སྔགས་འཆང་ཐམས་ཅད་ཀྱི་དབང་པོ་དུ་མ་རིག་སྔགས་འཆང་བརྒྱ་སྟོང་ཕྲག་གིས་ཡོངས་སུ་བསྐོར་བ་དང་། རིག་པའི་རྒྱལ་པོའི་ལྷ་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དང་། དཀྱིལ་འཁོར་གྱི་ལྷ་བརྒྱ་སྟོང་ཕྲགདུ་མ་དང་། དབང་པོ་དང་། ལྷའི་དབང་པོ་དང་། ཚངས་པ་དང་། ཁྱབ་འཇུག་དང་། དབང་ཕྱུག་ཆེན་པོ་དང་། གཙང་མའི་གནས་ཀྱི་རིས་ཀྱི་ལྷའི་བུ་བརྒྱ་སྟོང་ཕྲག་རྣམས་དང་། གཤིན་རྗེ་དང་། ཆུ་ལྷ་དང་། ལུས་ངན་པོ་དང་། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་།
en: Each is a wish-fulfilling jewel, a magical amogha creation of the illusion-like samādhi that is the true essence of Noble Avalokiteśvara, and each is very precious for vidyā holders.”

source: དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོའི་ཚོགས་སྟོང་ཕྲག་རྣམས་ཀྱིས་དེ་ལྟ་བུའི་གསུང་གི་སྒྲ་དབྱངས་ཐོས་ནས། དགའ་བ་དང་།
en: Vajrapāṇi—together with all the chief vidyādhara lords and their retinues of many hundreds of thousands of vidyādharas, with many hundreds of thousands of king of vidyā deities, and with many hundreds of thousands of maṇḍala deities; together with Indra the lord of gods, Brahmā, Viṣṇu, and Maheśvara; together with hundreds of thousands of divine sons from the realm of the Pure Abode; together with Yama, Varuṇa, and Kubera; and together with thousands upon thousands of devas, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, and mahoragas—was very pleased after hearing this superb talk.

source: མགུ་བ་དང་། ཡི་རངས་པ་དང་། རབ་ཏུ་མགུ་བ་དང་། དགའ་བ་དང་། ཡིད་བདེ་བ་སྐྱེས་པར་གྱུར་ཏོ།
en: He felt uplifted and inspired, and he swelled with affection and happiness.

source: །དེ་བཞིན་དུ་གཉིས་པར་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་ཉན་པ་ལ་དེ་རྣམས་ཐམས་ཅད་ལྷན་ཅིག་ཏུ་མཐུན་པར་རྒྱལ་པོ་ཆེན་པོ་བཞི་སྔོན་དུ་འགྲོ་བས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་ཕྱིན་ནས། བཅོམ་ལྡན་འདས་ལ་མེ་ཏོག་དང་། བདུག་པ་དང་། དྲི་དང་། ཕྲེང་བ་དང་།
en: After hearing the teaching on the two precious great jewel–like dhāraṇīs, he and all the others, led by the Four Great Kings, walked up to the Blessed One and offered worship using various types of flowers, incense, fragrances, garlands, scented oils, musical instruments, and drums.

source: བྱུག་པ་དང་། རོལ་མོ་དང་། ཕེག་རྡོབ་པ་སྣ་ཚོགས་པས་མཆོད་པ་བྱེད་པར་གྱུར་ཏོ། །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དེ་ལ་ཡང་མཆོད་པ་བྱེད་པར་གྱུར་ཅིག །རིག་པའི་རྒྱལ་པོ་དེ་ལ་ཡང་མཆོད་པར་བྱེད་དོ།
en: They also made offerings to Noble Avalokiteśvara and the king of vidyās, and they circumambulated the Blessed One hundreds of thousands of times.

source: །བཅོམ་ལྡན་འདས་ལ་ལན་བརྒྱ་སྟོང་ཕྲག་དུ་མས་བསྐོར་བ་བྱས་ནས་ལེགས་སོ་ཞེས་རྗོད་པར་བྱེད་དེ།
en: Vajrapāṇi then applauded the Blessed One: “Good!

source: བཅོམ་ལྡན་འདས་ལེགས་སོ་ལེགས་སོ།
en: It is good, Lord!

source: །བཅོམ་ལྡན་འདས་མཆོག་ཏུ་རྙེད་པར་དཀའ་བ་གང་ཡིན་པ་དང་། བཅོམ་ལྡན་འདས་གཉིས་པར་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་དོན་ཡོད་ཞགས་པའི་སྙིང་པོ་རྣམ་པར་ཐར་པའི་དཀྱིལ་འཁོར་འཛམ་བུའི་གླིང་དུ་རབ་ཏུ་བཞག་གོ་ཞེས་སོ།
en: These two great dhāraṇīs, precious as gems, are extremely difficult to find.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་བྱིན་གྱིས་བརླབས་སོ།
en: They are both magical transformations of the essence of Amoghapāśa, a maṇḍala of liberation that has been established in Jambudvīpa through your blessings, Lord.

source: །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས་གསུངས་པའོ། །འདི་ནི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་གསང་བའི་སྙིང་པོར་གྱུར་པ་ཐུན་མོང་བར་མཚུངས་པའོ།
en: Taught by Noble Avalokiteśvara, they represent the secret essence shared by all tathāgatas.

source: །ཐམས་ཅད་དུ་གསང་བ་ཕྱག་རྒྱ་དང་། གསང་སྔགས་རིམ་པར་ཕྱེ་བ་དང་། དཀྱིལ་འཁོར་ཐམས་ཅད་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་མཆོད་པའི་སྤྲིན་གྱི་རྣམ་པར་འཕྲུལ་པ་མཆོག་ཏུ་རྙེད་པར་དཀའ་བར་གསུངས་པའོ།
en: Noble Avalokiteśvara taught all the secret sets of mudrās and mantras, the maṇḍalas, and the magical creation of the clouds of offerings for all the tathāgatas, all of which are so difficult to find. “

source: །བཅོམ་ལྡན་འདས་བདག་དེ་དག་ཐམས་ཅད་མཐུན་པར་གྱུར་པས་ལྷན་ཅིག་པ་ཁོ་ནར་རྟག་ཏུ་རྗེས་སུ་འབྲང་ཞིང་། རིག་པའི་རྒྱལ་པོ་འདི་ཡང་དག་པར་རྗེས་སུ་འབྲང་བར་བགྱིའོ། །འདི་ཡོངས་སུ་བསྲུང་བར་བགྱིའོ། །འདི་ལྟ་སྟེ། འཛིན་པ་དང་། འདོན་པ་དང་།
en: Accordingly, Lord, I and all the others will remain connected and bound to this king of vidyās.

source: མཆོད་པ་དང་། བསྙེན་བཀུར་བྱེད་པ་དང་། བྲི་བ་དང་། འདྲིར་འཇུག་པ་དང་། ཉན་པ་དང་། བཟླས་པའི་ལས་སུ་འགྱུར་བར་བགྱིའོ།
en: We will do so by upholding it, reading it aloud, worshiping it, honoring it, writing it down, causing it to be written, listening to it, and reciting it.

source: །རིག་སྔགས་འཆང་དེ་ལ་ཡང་རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་བསྲུང་བ་དང་། བསྐྱབ་པ་དང་། སྦ་བར་བགྱིའོ། །དངོས་གྲུབ་ཀྱང་སྩལ་བར་བགྱིའོ། །རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོའམ། དགེ་སློང་ངམ། དགེ་སློང་མའམ། དགེ་བསྙེན་ནམ།
en: We will always remain close by in order to guard, protect, and defend vidyā holders who do the same.

source: དགེ་བསྙེན་མའམ། དགེ་སྦྱོང་ངམ། བྲམ་ཟེའམ། རྒྱལ་རིགས་སམ། བུད་མེད་དམ།
en: We will grant accomplishments to them whether they are sons or daughters of good family, monks or nuns, male or female lay practitioners, ascetics, brahmins, or kṣatriyas, women, men, boys, or girls.

source: སྐྱེས་པའམ། ཁྱེའུའམ། བུ་མོ་གང་ཡིན་པ་དེ་ཡང་ཆོ་ག་ཞིབ་མོའི་རྒྱལ་པོ་འདིའི་མིང་ཐོས་པ་ཙམ་གྱིས་ཀྱང་།
en: We will grant them even to those who merely hear the name of this sovereign ritual. “

source: དེ་ལ་བདག་ཅག་ཐམས་ཅད་མཐུན་པར་རྟག་ཏུ་རྗེས་སུ་འབྲང་བར་བགྱི། བསྲུང་བ་དང་། བསྐྱབ་པ་དང་། སྦ་བ་དང་།
en: I, together with all the others, will remain bound to such practitioners in order to guard, protect, and defend them.

source: སྟོབས་དང་། བརྩོན་འགྲུས་དང་། མདངས་དང་། དགའ་བ་བསྒྲུབ་པར་བགྱི།
en: I will grant them strength, energy, vitality, and joy.

source: སྡིག་པ་དང་། སྒྲིབ་པ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བགྱི། ནད་ཐམས་ཅད་བསལ་བར་བགྱི། འཇིགས་པ་དང་། ཐབ་མོ་དང་། འཐབ་པ་དང་། རྩོད་པ་དང་། འགྱེད་པ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བགྱི། ཡམས་དང་། ཉེ་བར་འཚེ་བ་དང་།
en: I will pacify all their wrongdoings and obscurations and remove all their diseases.

source: ནད་འགོ་བ་དང་། འཁྲུག་པ་དང་། མུ་གེ་དང་། མི་ངས་དང་། འབྲོག་དགོན་པའི་འཇིགས་པ་ཐམས་ཅད་སོ་སོར་ཕྱིར་བཟློག་པར་བགྱི།
en: I will pacify all dangers, quarrels, disputes, and disagreements and prevent the danger of accidents, misfortunes, calamities, and tragedies, including famine, pestilence, and plague.

source: བདེ་བ་ལ་ཡང་དག་པར་རེག་པ་དང་། མཆོག་ཏུ་དགའ་བ་བསྒྲུབ་པར་བགྱི། བསྲུང་བར་བགྱི།
en: I will grant them happiness, comfort, and supreme joy.

source: ཡོངས་སུ་བསྐྱང་བར་བགྱི། དོན་མེད་པ་ཡང་སོ་སོར་བཟློག་པར་བགྱི། དོན་ལ་ཡང་ཡང་དག་པར་སྦྱར་བར་བགྱི། དོན་ཐམས་ཅད་རྗེས་སུ་སྩལ་བར་བགྱི། རྟག་ཏུ་མཆོག་སྩལ་བར་བགྱིའོ།
en: I will guard and protect them, prevent them from falling into poverty, and provide them with wealth by giving them all kinds of riches and granting them boons.

source: །བཅོམ་ལྡན་འདས་ཤིན་ཏུ་རྒྱས་པའི་ཆོ་ག་ཆོ་ག་ཞིབ་མོའི་ཡོ་བྱད་དུ་དགོངས་པའོ།
en: May the practice of the full ritual procedures of the Blessed Lord flourish!”

source: །དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་ཕྱག་ན་རྡོ་རྗེ་སྔོན་དུ་འགྲོ་བས་རྒྱལ་པོ་ཆེན་པོ་བཞི་དང་། རིགས་པའི་རྒྱལ་པོའི་ལྷ་དེ་རྣམས་དང་། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ནམ་མཁའ་ལྡིང་དང་།
en: The Blessed One then applauded Vajrapāṇi, the Four Great Kings who attended upon him, and all the celestial kings of vidyās, devas, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, and mahoragas who accompanied him: “Good!

source: མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་རྣམས་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ།
en: It is good, my esteemed friends!

source: ལེགས་སོ་ལེགས་སོ་དྲང་སྲོང་ཆེན་པོ་དེ་ལྟ་བུ་བྱེད་པ་དེ་རྣམས་ཡོངས་སུ་བསྐྱང་བར་བྱ། བསྲུང་བར་བྱ། དངོས་གྲུབ་ཀྱང་སྦྱིན་པར་བྱའོ། །ངས་ཆོ་ག་ཞིབ་མོའི་རྒྱལ་པོ་རྒྱ་མཚོའི་དཀྱིལ་འཁོར་དང་།
en: You should indeed act in this manner, guarding and protecting practitioners and granting them success.

source: གསང་སྔགས་དང་། དཀྱིལ་འཁོར་གྱི་ཆོ་ག་ཞིབ་མོ་འདི་ཡོངས་སུ་སྲུང་བའི་ཆེད་དང་། སེམས་ཅན་དེ་རྣམས་ཐམས་ཅད་ཡོངས་སུ་སྲུང་བའི་ཆེད་དང་། སེམས་ཅན་ཐམས་ཅད་སྲུང་བའི་ཆེད་དང་། ཡོངས་སུ་བསྐྱང་བའི་ཆེད་དུ་གྲོགས་པོ་རྣམས་ལ་རྗེས་སུ་གཏད་དོ།
en: I entrust to you, friends, this sovereign ritual with its mudrās, maṇḍalas, mantras, and rites, so that you duly protect it, and so that you guard and protect all beings.

source: །འདི་ཡང་བསྲུང་བར་བྱའོ་ཞེས་སོ།
en: They need to be protected.”

source: །དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཕྱག་རྒྱ་དང་དཀྱིལ་འཁོར་གྱི་རིམ་པར་ཕྱེ་བའི་ཆོ་ག་སྨྲོས་ཤིག །དོན་ཡོད་པའི་ནོར་བུའི་མཆོད་པའི་སྙིང་པོའི་གཟུངས་ཀྱི་གསང་བ་དང་།
en: Turning to Noble Avalokiteśvara, the Blessed One said, “Please teach, Avalokiteśvara, the mudrā and maṇḍala procedures for the heart dhāraṇī of precious amogha offerings.

source: རིག་སྔགས་འཆང་ཐམས་ཅད་ཀྱི་སྙིང་པོའི་གསང་བ་མཆོག་གི་དངོས་གྲུབ་འདི་ཐམས་ཅད་དུ་ཐུན་མོང་བའི་སྙིང་པོ་གྲུབ་པའོ།
en: This secret dhāraṇī brings the supreme accomplishment to all vidyā holders: the accomplishment of the universal common essence.”

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས་དོན་ཡོད་པ་ལྕགས་ཀྱུའི་ཆོ་ག་ཞིབ་མོའི་རྒྱལ་པོའི་རིག་པའི་རྒྱལ་པོ་དོན་ཡོད་པ་ནོར་བུ་མཆོད་པའི་སྙིང་པོའི་གཟུངས་ཀྱི་ཕྱག་རྒྱ་དང་། དཀྱིལ་འཁོར་གྱི་ཆོ་ག་དང་། རས་རིས་རྣམས་གསུངས་པ།
en: Noble Avalokiteśvara, the great bodhisattva being, then taught the procedure of the mudrā, the maṇḍala, and the cloth painting for the heart dhāraṇī of precious amogha offerings, the procedure that constitutes a sovereign rite of Amoghāṅkuśa. “

source: དེ་ནས་འདིའི་དཀྱིལ་འཁོར་བཤད་པར་བྱའོ།
en: Now I will teach the maṇḍala for the supreme rite of the heart dhāraṇī of precious amogha offerings.

source: །དོན་ཡོད་པ་མཆོད་པའི་ནོར་བུའི་སྙིང་པོ་བླ་ན་མེད་པ་ནི་དཀྱིལ་འཁོར་གྲུ་བཞི་པ་བྱས་ཏེ།
en: Using clay and cow dung, the vidyā holder should build a symmetrical, carefully delimited four-sided maṇḍala.

source: ཀུན་ནས་ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བ་ས་དང་བ་བྱུང་གིས་ལེགས་པར་བྱུགས་ཤིང་ཤིན་ཏུ་འཇམ་པ་ལ།
en: Its surface should be swept clean and made smooth.

source: ཚོན་སྣ་ཚོགས་པས་བཀྲ་བའི་སྲད་བུས་ཆར་གཞལ་ཅིང་བཅད་ལ་དཀྱིལ་འཁོར་བླ་ན་མེད་པའི་དབུས་ཀྱི་དཀྱིལ་འཁོར་གྱི་སྙིང་པོར་བདག་གི་ཁྲུའི་ཚད་ཀྱིས་ཀུན་ནས་ཁྲུ་བཞི་པ་སྒོ་བཞི་རྣམ་པར་ཕྱེ་བ་བྱའོ།
en: The vidyā holder should delimit the sections of this supreme maṇḍala using multicolored thread of various bright colors. The inner area should be one cubit across, symmetrical, and have four doors demarcated on its four sides.

source: །ཐམས་ཅད་དུ་གསང་བ་ཐུན་མོང་བའི་དཀྱིལ་འཁོར་དང་།
en: This maṇḍala, common to all tathāgata families, is secret in every respect.

source: དབུས་ཀྱི་དཀྱིལ་འཁོར་གྱི་སྙིང་བོར་ཡང་པདྨ་བྱ་སྟེ། པདྨ་སྟོང་ཕྲག་གིས་ཤིན་ཏུ་མཛེས་པ་ལྔ་ལྔའོ།
en: In the center of the maṇḍala, the vidyā holder should draw a lotus with thousands of petals that have the immaculate color of a white lotus and are arranged in groups of five.

source: །པདྨ་དཀར་པོ་བླ་ན་མེད་པ་ལ་ཟེ་འབྲུ་དང་། གེ་སར་གྱི་ཚད་ལ་བབ་པ། ཡིད་བཞིན་གྱི་ནོར་བུའི་གེ་སར་དང་། ཟེ་འབྲུ་བཀྲ་བའི་དྲ་བའི་སྙིང་པོ་ལུས་དང་ལག་ཏུ་འཆང་ཞིང་ལག་པའི་ཕྱག་རྒྱ་གཡོན་པ་དང་གཡས་པས་བྱའོ། །དར་དཔྱངས་དང་འཁྱིལ་པས་སྤ་བ།
en: Fitting within the size of the lotus’ pericarp and filaments, he should draw a wish-fulfilling jewel, a lattice, right and left hands that form mudrās, and lotus rings. “

source: ཟུར་ཟུར་དུ་དཔག་བསམ་གྱི་ཤིང་ཤིན་ཏུ་ཚད་ལ་བབ་པ་ཆོ་ག་ཇི་ལྟ་བ་བཞིན་དུ་བྱེད་དུ་གཞུག་གོ།
en: In each of the four corners, the vidyā holder should draw, as required, a well-proportioned wish-fulfilling tree.

source: །སྙིང་པོའི་འཁོར་གྱི་རེ་ཁཱ་ཡང་ཆོ་ག་ཇི་ལྟ་བ་བཞིན་དུ་ཤིན་ཏུ་ཚད་དང་ལྡན་པར་བྱའོ། །མེ་ཏོག་དང་འབྲས་བུ་སྣ་ཚོགས་པ་བྱ་ཞིང་དེ་ནས་མེ་ཏོག་གི་བར་དུ་རེ་ཁཱ་བྱའོ།
en: He should draw a line of various flowers and fruits within the maṇḍala.

source: །རྒྱན་སྣ་ཚོགས་ཀྱིས་རྣམ་པར་བརྒྱན་པ། གོས་སྣ་ཚོགས་པས་མཛེས་པའོ། །སྣ་ཚོགས་པའི་རྒྱན་གྱི་ཕྱི་རོལ་ཏུ་པདྨ་དང་། ཨུཏྤ་ལ་སྔོན་པོའི་ཕྲེང་བའི་རི་མོའོ།
en: He should skillfully draw various ornaments, adornments, and pieces of clothing adjacent to the line of flowers, and garlands of white and blue lotuses next to the line of ornaments.
